class GamesMock:
    gameList = [
        {'id': '0', 'name': 'Первый тур чемпионата лицея №130 по Математическим Абакам', 'gameType': '0', 'start': 1702371081000, 'status': '0'},
        {'id': '1', 'name': 'Первый тур чемпионата лицея №130 по Математическим Абакам', 'gameType': '1', 'start': 1670835081000, 'status': '1'},
        {'id': '2', 'name': 'Первый тур чемпионата лицея №130 по Математическим Абакам', 'gameType': '2', 'start': 1639299081000, 'status': '2'},
        {'id': '3', 'name': 'Первый тур чемпионата лицея №130 по Математическим Абакам', 'gameType': '1', 'start': 1639299081000, 'status': '3'},
        {'id': '4', 'name': 'Первый тур чемпионата лицея №130 по Математическим Абакам', 'gameType': '0', 'start': 1607763081000, 'status': '4'},
    ]

    scores = [
        '+1',
        '+2',
        '+3',
        '+4',
        '+5',
        '+6',
    ]

    teams = [
        {'id': 1, 'name': 'Мы команда да?', 'sumScore': 30, 'scores': scores},
        {'id': 2, 'name': 'Мы команда2 да?', 'sumScore': 30, 'scores': scores},
        {'id': 3, 'name': 'Мы cumанда да?', 'sumScore': 30, 'scores': scores},
    ]

    game = {
        'id': '0',
        'name': 'Первый тур чемпионата лицея №130 по Математическим Абакам',
        'gameType': '0',
        'start': 1702371081000,
        'status': '0',
        'timeGame': 12600,
        'teams': teams
    }
