class GamesMock:
    gameList = [
        {'id': '0', 'name': 'Первый тур чемпионата лицея №130 по Математическим Абакам', 'gameType': '0', 'start': '1702371081000', 'status': '0'},
        {'id': '1', 'name': 'Первый тур чемпионата лицея №130 по Математическим Абакам', 'gameType': '1', 'start': '1670835081000', 'status': '1'},
        {'id': '2', 'name': 'Первый тур чемпионата лицея №130 по Математическим Абакам', 'gameType': '2', 'start': '1639299081000', 'status': '2'},
        {'id': '3', 'name': 'Первый тур чемпионата лицея №130 по Математическим Абакам', 'gameType': '1', 'start': '1639299081000', 'status': '3'},
        {'id': '4', 'name': 'Первый тур чемпионата лицея №130 по Математическим Абакам', 'gameType': '0', 'start': '1607763081000', 'status': '4'},
    ]


class GameAllInfoMock:
    gameAllInfo = {
        'id': 0,
        'name': 'Первый тур чемпионата лицея №130 по Математическим Абакам',
        'gameType': 0,
        'start': 1702371081000,
        'status': 0,
        'timeGame': 12600,
        'teams': [
            {'id': 0, 'name': 'Барабашки', 'sumScore': 30, 'scores': ['+1', '+2', '+3', '+4', '+5', '+6']},
            {'id': 1, 'name': 'Тугрики', 'sumScore': 30, 'scores': ['+1', '+2', '+3', '+4', '+5', '+6']},
            {'id': 2, 'name': 'Абвгдеёжзик', 'sumScore': 30, 'scores': ['+1', '+2', '+3', '+4', '+5', '+6']},
            {'id': 3, 'name': 'Джаваскриптизёры', 'sumScore': 30, 'scores': ['+1', '+2', '+3', '+4', '+5', '+6']}
        ]
    }

    games = [
        gameAllInfo,
    ]
